<template>
  <div>
    <OverlayPanel ref="op">
      <h3>Противопоказания</h3>
      <ol>
        <li>Вы едите много чипсов</li>
        <li>Вы пьете много газировки</li>
      </ol>
    </OverlayPanel>
    <div class="flex flex-column gap-3">
      <div>
        <h2>Как стать донором?</h2>
        <ol>
          <li>Убедитесь, что у вас нет <a href="#" @click="toggle">противопоказаний</a> к сдаче крови.</li>
          <li>Выберите ближайший центр крови, уточните потребности по указанным телефонам и запланируйте донацию.</li>
          <li>В запланированный день приходите в центр крови, не забудьте паспорт!</li>
          <li>После донации вы получите справку - сфотографируйте её и загрузите в ваш личный кабинет.</li>
        </ol>
      </div>

      <div>
        <h2>Как подготовиться к сдаче крови?</h2>
        <ul>
          <li>Накануне и в день сдачи крови не рекомендуется употреблять жирную, жареную, острую и копченую пищу.</li>
          <li>За 48 часов до визита на станцию переливания нельзя употреблять алкоголь.</li>
          <li>Утром нужно легко позавтракать. Натощак сдавать кровь нельзя!</li>
        </ul>
      </div>

      <div>
        <h2>Что делать после сдачи крови?</h2>
        <ul>
          <li>Если вы чувствуете головокружение или слабость, обратитесь к персоналу.</li>
          <li>Воздержитесь от курения в течение часа до и после кроводачи.</li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script>
import OverlayPanel from "primevue/overlaypanel";

export default {
  components: {
    OverlayPanel
  },
  data() {
    return {
    }
  },
  methods: {
    toggle(event) {
      this.$refs.op.toggle(event);
    }
  }
}
</script>